Feature: scan barcodes

  Scenario: 根据条码，返回小票信息
    When 根据条码结果输出小票
    Given 条码扫描数据有
      | 条目         |
      | 12345678   |
      | 22345678-3 |
      | 82203002-1.5 |
      | 82203003-0.5 |
    And 有商品
      | 条码       | 名称    | 价格    | 单位 | 类型 |
      | 12345678 | pizza | 15.00 |    | 0  |
      | 22345678 | milk  | 12.30 | L  | 0  |
      | 82203002 | rice   | 7.09  | KG | 1  |
      | 82203003 | orange | 13.07 | KG | 1  |
    Then 扫描条码结果为
    """
     {
      "data": [
        "****** SuperMarket receipt ******",
        "pizza: 1 x 15.00 --- 15.00",
        "milk: 3(L) x 12.30 --- 36.90",
        "rice: 1.5(KG) x 7.09 --- 10.63",
        "orange: 0.5(KG) x 13.07 --- 6.53",
        "---------------------------------",
        "total: 69.06(CNY)",
        "*********************************"
      ]
    }
    """

  Scenario: 如果条码不存在，返回错误信息
    When 根据条码结果输出小票
    Given 条码扫描数据有
      | 条目       |
      | 88888888 |
    And 有商品
      | 条码       | 名称    | 价格    | 单位 | 类型 |
      | 12345678 | pizza | 15.00 |    | 0  |
      | 22345678 | milk  | 12.30 | L  | 0  |
    Then 扫描条码结果为
    """
     {
	  "data": null,
	  "error": "item doesn't exist: 88888888"
     }
    """
